Laravel/app/Http/Controllers/CourseClassController.php

    public function index(Request $request)
    {
        $courseClassSearch = $request->input('courseClassSearch');
        $courseFilter = $request->input('courseFilter');

        $query = CourseClass::with('users', 'course');

        if ($courseFilter && $courseFilter !== 'all') {
            $query->whereHas('course', function ($courseQuery) use ($courseFilter) {
                $courseQuery->where('id', $courseFilter);
            });
        }

        if ($courseClassSearch) {
            $query->where(function ($courseClassQuery) use ($courseClassSearch) {
                $courseClassQuery->where('description', 'like', "%$courseClassSearch%");
            });
        }

        $courseClasses = $query->paginate(5);
---
select * from `course_classes` limit 5 offset 0
select * from `courses` where `courses`.`id` in (1, 2, 3, 4, 5) and `courses`.`deleted_at` is null
select * from `users` where `users`.`course_class_id` in (1, 2, 3, 4, 5) and `users`.`deleted_at` is null
select count(*) as aggregate from `course_classes`