Laravel/app/Http/Controllers/CourseClassController.php

select * from `course_classes` limit 5 offset 0
select * from `users` where `users`.`course_class_id` in (1, 2, 3, 4, 5) and `users`.`deleted_at` is null
select count(*) as aggregate from `course_classes`
select * from `courses` where `courses`.`deleted_at` is null
---
    public function index()
    {
        $courseClasses = CourseClass::with('users')->paginate(5);
        $courses = Course::all();

select * from `courses` where `courses`.`deleted_at` is null
select * from `users` where `isStudent` = 1 and `users`.`deleted_at` is null limit 5 offset 0
select count(*) as aggregate from `users` where `isStudent` = 1 and `users`.`deleted_at` is null
---
    public function create()
    {
        $courses = Course::all();
        //select * from users where isStudent = 1


        $students = User::where('isStudent', 1)->paginate(5);

insert into `course_classes` (`description`, `course_id`, `updated_at`, `created_at`) values ('asdd', '1', '2024-01-19 15:49:54', '2024-01-19 15:49:54')
---
    public function store(Request $request)
    {
        $request->validate([
            'description' => 'required',
            'course_id' => 'required',
        ]);

        $courseClass = CourseClass::create([
            'description' => $request->input('description'),
            'course_id' => $request->input('course_id'),
        ]);