Laravel/app/Http/Controllers/CourseController.php

select * from `courses` where `courses`.`deleted_at` is null limit 5 offset 0
select count(*) as aggregate from `courses` where `courses`.`deleted_at` is null
---
    public function index(Request $request)
    {

        $courseSearch = $request->input('courseSearch');





        $query = Course::query();

        if ($courseSearch) {
            $query->where(function ($query) use ($courseSearch) {
                $query->where('description', 'like', '%' . $courseSearch . '%')
                    ->orWhere('code', 'like', '%' . $courseSearch . '%');
            });
        }

        $courses = $query->paginate(5);