Laravel/app/Http/Controllers/MaterialController.php

    public function index(Request $request)
    {
        $search = $request->input('search');
        $materialFilter = $request->input('materialFilter');

        if ($materialFilter === "internal") {
            $materials = Material::with('sizes', 'courses')
                ->where('isInternal', 1)
                ->where('isClothing', 0)
                ->paginate(5);
        } elseif ($materialFilter === "external") {
            $materials = Material::with('sizes', 'courses')
                ->where('isInternal', 0)
                ->paginate(5);
        } elseif ($materialFilter === "clothing") {
            $materials = Material::with('sizes', 'courses')
                ->where('isClothing', 1)
                ->paginate(5);
        } elseif ($materialFilter === "all") {
            $materials = Material::with('sizes', 'courses')->paginate(5);
        } else {
            $materials = Material::with('sizes', 'courses')->paginate(5);
---
select * from `materials` where `isInternal` = 1 and `isClothing` = 0 and `materials`.`deleted_at` is null limit 5 offset 0
select `courses`.*, `course_materials`.`material_id` as `pivot_material_id`, `course_materials`.`course_id` as `pivot_course_id` from `courses` inner join `course_materials` on `courses`.`id` = `course_materials`.`course_id` where `course_materials`.`material_id` in (5, 6, 7, 8, 9) and `courses`.`deleted_at` is null
select `sizes`.*, `material_sizes`.`material_id` as `pivot_material_id`, `material_sizes`.`size_id` as `pivot_size_id`, `material_sizes`.`stock` as `pivot_stock` from `sizes` inner join `material_sizes` on `sizes`.`id` = `material_sizes`.`size_id` where `material_sizes`.`material_id` in (5, 6, 7, 8, 9) and `sizes`.`deleted_at` is null
select count(*) as aggregate from `materials` where `isInternal` = 1 and `isClothing` = 0 and `materials`.`deleted_at` is null
select * from `materials` where (`isInternal` = 1 and `isClothing` = 0) and `materials`.`deleted_at` is null limit 5 offset 0
select `courses`.*, `course_materials`.`material_id` as `pivot_material_id`, `course_materials`.`course_id` as `pivot_course_id` from `courses` inner join `course_materials` on `courses`.`id` = `course_materials`.`course_id` where `course_materials`.`material_id` in (3, 4) and `courses`.`deleted_at` is null
select `sizes`.*, `material_sizes`.`material_id` as `pivot_material_id`, `material_sizes`.`size_id` as `pivot_size_id`, `material_sizes`.`stock` as `pivot_stock` from `sizes` inner join `material_sizes` on `sizes`.`id` = `material_sizes`.`size_id` where `material_sizes`.`material_id` in (3, 4) and `sizes`.`deleted_at` is null
select count(*) as aggregate from `materials` where (`isInternal` = 1 and `isClothing` = 0) and `materials`.`deleted_at` is null
select * from `materials` where `isClothing` = 1 and `materials`.`deleted_at` is null limit 5 offset 0
select `courses`.*, `course_materials`.`material_id` as `pivot_material_id`, `course_materials`.`course_id` as `pivot_course_id` from `courses` inner join `course_materials` on `courses`.`id` = `course_materials`.`course_id` where `course_materials`.`material_id` in (1, 2, 3, 4, 5) and `courses`.`deleted_at` is null
select `sizes`.*, `material_sizes`.`material_id` as `pivot_material_id`, `material_sizes`.`size_id` as `pivot_size_id`, `material_sizes`.`stock` as `pivot_stock` from `sizes` inner join `material_sizes` on `sizes`.`id` = `material_sizes`.`size_id` where `material_sizes`.`material_id` in (1, 2, 3, 4, 5) and `sizes`.`deleted_at` is null
select count(*) as aggregate from `materials` where `isClothing` = 1 and `materials`.`deleted_at` is null
select * from `materials` where `materials`.`deleted_at` is null limit 5 offset 0
select count(*) as aggregate from `materials` where `materials`.`deleted_at` is null