Laravel/app/Http/Controllers/MaterialUserController.php

select * from `course_classes` limit 5 offset 0
select count(*) as aggregate from `course_classes`
select * from `courses` where `courses`.`deleted_at` is null
---
    public function index()
    {

        $courseClasses = CourseClass::with('students')->paginate(5);
        $courses = Course::all();

select * from `users` where `users`.`id` = '8' and `users`.`deleted_at` is null limit 1
select * from `course_classes` where `course_classes`.`id` = 5 limit 1
select * from `materials` where `isClothing` = 1 and exists (select * from `courses` inner join `course_materials` on `courses`.`id` = `course_materials`.`course_id` where `materials`.`id` = `course_materials`.`material_id` and `courses`.`id` = 5 and `courses`.`deleted_at` is null) and `materials`.`deleted_at` is null
select `courses`.*, `course_materials`.`material_id` as `pivot_material_id`, `course_materials`.`course_id` as `pivot_course_id` from `courses` inner join `course_materials` on `courses`.`id` = `course_materials`.`course_id` where `course_materials`.`material_id` in (18, 19) and `courses`.`deleted_at` is null
select `sizes`.*, `material_sizes`.`material_id` as `pivot_material_id`, `material_sizes`.`size_id` as `pivot_size_id`, `material_sizes`.`stock` as `pivot_stock` from `sizes` inner join `material_sizes` on `sizes`.`id` = `material_sizes`.`size_id` where `material_sizes`.`material_id` in (5, 6, 8, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19) and `sizes`.`deleted_at` is null
---
    public function create($id)
    {
        $student = User::find($id);
        $studentCourseId = $student->courseClass->course_id;

        $clothes = Material::with('sizes', 'courses')
            ->where('isClothing', 1)
            ->whereHas('courses', function ($query) use ($studentCourseId) {
                $query->where('courses.id', $studentCourseId);
            })
            ->get();

insert into `material_users` (`material_id`, `user_id`, `quantity`, `size_id`, `delivery_date`, `delivered_all`, `updated_at`, `created_at`) values ('5', '6', '2', '25', '2024-01-01', '1', '2024-01-21 18:20:56', '2024-01-21 18:20:56')
select * from `material_sizes` where `material_id` = '5' and `size_id` = '25' and `material_sizes`.`deleted_at` is null limit 1
---
    public function store(Request $request)
    {
        $request->validate([
            'selectedClothing' => 'required|array',
            'user_id' => 'required',
            'quantity' => 'required|array',
            'material_size_id' => 'required|array',
            'delivery_date' => 'required|array',
            'delivered_all' => 'required',
        ]);

        $selectedClothingitems = $request->get('selectedClothing');
        $note = $request->get('additionalNotes');

        foreach ($selectedClothingitems as $index => $selectedClothingitem) {

            $itemSize = $request->get('material_size_id')[$index];
            $itemQuantity = $request->get('quantity')[$index];
            $itemDeliveryDate = $request->get('delivery_date')[$index];
            $materialUser = new MaterialUser([
                'material_id' => $selectedClothingitem,
                'user_id' => $request->get('user_id'),
                'quantity' => $itemQuantity,
                'size_id' => $itemSize,
                'delivery_date' => $itemDeliveryDate,
                'delivered_all' => $request->get('delivered_all'),
            ]);


            $materialUser->save();

            $materialSize = MaterialSize::where('material_id', $selectedClothingitem)
                ->where('size_id', $itemSize)
                ->first();

update `material_sizes` set `stock` = 8, `material_sizes`.`updated_at` = '2024-01-21 18:20:56' where `id` = 1
---
            if ($materialSize) {
                $newStock = $materialSize->stock - $itemQuantity;
                $materialSize->stock = $newStock;
                $materialSize->save();