Laravel/app/Http/Controllers/PartnerTrainingUserController.php

select * from `users` where `users`.`id` in (10) and `users`.`deleted_at` is null
select * from `partner_training_users` where `partner_training_users`.`partner_id` in (1, 2, 3, 4, 5, 6) and `partner_training_users`.`deleted_at` is null
select * from `partners` where `partners`.`deleted_at` is null
select * from `trainings` where `trainings`.`deleted_at` is null
select * from `partner_training_users` where `partner_training_users`.`deleted_at` is null limit 5 offset 0
select * from `partners` where `partners`.`id` in (1, 2, 3, 4, 5) and `partners`.`deleted_at` is null
select * from `trainings` where `trainings`.`id` in (1, 2, 3, 4, 5) and `trainings`.`deleted_at` is null
---
    public function index(Request $request)
    {

//      dd($request->all());
        $searchPtu = $request->input('ptu');
        $searchP = $request->input('p');
        $searchT = $request->input('t');




                if ($searchPtu) {
                    $partner_Training_Users = PartnerTrainingUser::with('partner', 'training', 'user')
                        ->whereHas('partner', function ($query) use ($searchPtu) {
                            $query->where('name', 'like', "%$searchPtu%");
                        })
                        ->orWhereHas('training', function ($query) use ($searchPtu) {
                            $query->where('name', 'like', "%$searchPtu%");
                        })
                        ->orWhereHas('user', function ($query) use ($searchPtu) {
                            $query->where('name', 'like', "%$searchPtu%");
                        })->paginate(5);
                } else {
                    $partner_Training_Users = PartnerTrainingUser::with('partner', 'training', 'user')->paginate(5);

select * from `contact_partners` where `contact_partners`.`partner_id` in (1, 2, 3, 4, 5) and `contact_partners`.`deleted_at` is null
select * from `partner_training_users` where `partner_training_users`.`partner_id` in (1, 2, 3, 4, 5) and `partner_training_users`.`deleted_at` is null
select * from `partners` where `partners`.`deleted_at` is null limit 5 offset 0
select count(*) as aggregate from `partners` where `partners`.`deleted_at` is null
---
                        ->where('name', 'like', "%$searchP%")
                        ->paginate(5);
                } else {
                    $partners = Partner::with('partnerTrainingUsers', 'contactPartner')->paginate(5);

select * from `partner_training_users` where `partner_training_users`.`training_id` in (1, 2, 3, 4, 5) and `partner_training_users`.`deleted_at` is null
select * from `trainings` where `trainings`.`deleted_at` is null limit 5 offset 0
select count(*) as aggregate from `trainings` where `trainings`.`deleted_at` is null
---
                if ($searchT) {
                    $trainings = Training::where('name', 'like', "%$searchT%")->paginate(5);
                } else {
                    $trainings = Training::with('partnerTrainingUsers')->paginate(5);

select * from `partner_training_users` where `partner_training_users`.`deleted_at` is null
select * from `partners` where `partners`.`deleted_at` is null
select * from `users` where `users`.`deleted_at` is null
select * from `trainings` where `trainings`.`deleted_at` is null
select * from `materials` where `isInternal` = 0
---
    public function create()
    {
        $partner_Training_Users = PartnerTrainingUser::all();
        $partners = Partner::all();
        $users = User::all();
        $trainings = Training::all();

        $materials = DB::table('materials')->where('isInternal', '=', false)->get();