Laravel/app/Http/Controllers/PartnerTrainingUserController.php

select * from `contact_partners` where `contact_partners`.`partner_id` in (1, 2, 3, 4, 5, 6) and `contact_partners`.`deleted_at` is null
---
    public function index()
    {
        $partner_Training_Users = PartnerTrainingUser::with('partner', 'training', 'user')->get();

        $partners = Partner::with('partnerTrainingUsers', 'contactPartner')->get();