Laravel/app/Http/Controllers/PartnerController.php

select * from `partners` where `partners`.`deleted_at` is null
---
    public function create()
    {
        $partners = Partner::all();

select * from `partners` where `partners`.`id` = '7' and `partners`.`deleted_at` is null limit 1
---
    public function edit($id)
    {
        $partner = Partner::findOrFail($id);