Laravel/app/Http/Controllers/TicketController.php

select * from `tickets`
select * from `users` where `users`.`deleted_at` is null
---
    public function index()
    {
        $tickets = Ticket::with('users','requester')->get();