Laravel/app/Http/Controllers/UserController.php

select * from `course_classes` where `course_classes`.`id` in (3, 4)
select * from `roles` where `roles`.`id` in (1, 2, 3)
select * from `users` where `users`.`deleted_at` is null limit 5 offset 0
select count(*) as aggregate from `users` where `users`.`deleted_at` is null
select * from `course_classes`
select * from `roles`
---
    public function index(Request $request)
    {

        $searchName = $request->input('searchName');
        $roleFilter = $request->input('roleFilter');

        $query = User::with('courseClass', 'role');

        if ($roleFilter && $roleFilter !== 'all') {
            $query->whereHas('role', function ($roleQuery) use ($roleFilter) {
                $roleQuery->where('id', $roleFilter);
            });
        }

        if ($searchName) {
            $query->where('name', 'like', "%$searchName%");

        }



        $users = $query->paginate(5);
        $courseClasses = CourseClass::all();
        $roles = Role::all();

select * from `course_classes`
select * from `courses` where `courses`.`id` in (1, 2, 3, 4, 5) and `courses`.`deleted_at` is null
select * from `roles`
select * from `roles` where `roles`.`id` in (2)
---
    public function show(User $user)
    {
        $courseClasses = CourseClass::with('Course')->get();
        $roles = Role::all();



        if ($user->isStudent == 1) {
            $user->load('courseClass', 'role');
            $courseDescription = $user->courseClass ? $user->courseClass->course->description : null;

        } else {
            $user->load('role');

select * from `course_classes`
select * from `courses` where `courses`.`deleted_at` is null
select * from `roles`
select * from `course_classes` where `course_classes`.`id` in (1)
select * from `courses` where `courses`.`id` in (1) and `courses`.`deleted_at` is null
select * from `roles` where `roles`.`id` in (1)
---
    public function edit(User $user)
    {
        $courseClasses = CourseClass::all();
        $courses = Course::all();
        $roles = Role::all();
        $user->load('CourseClass.Course', 'Role');