Laravel/app/Imports/StudentImportClass.php

select * from `course_classes`
---
    public function model(array $row)
    {
        if(strtolower($row[0]) == 'name'){
            return null;
        }
        else if($row[0] != null){
            $courseClasses = CourseClass::all();